app/Controllers/BookingController.php

    public function index()
    {
        $bookingModel = new BookingModel();
        $data['bookings'] = $bookingModel->findAll();
---
SELECT *
FROM `bookings`