app/Controllers/DriverController.php

SELECT *
FROM `drivers`
---
    public function index()
    {
        $data['drivers'] = $this->driverModel->findAll();