app/Controllers/MaintenanceController.php

    public function maintenance()
    {
        $model = new MaintenanceModel();
        $data['records'] = $model->findAll(); // Fetch all maintenance records
---
SELECT *
FROM `maintenance`