app/Controllers/TruckController.php

    public function trucks()
    {
        $model = new TruckModel();
        $data['trucks'] = $model->findAll(); // Fetch all truck records
---
SELECT *
FROM `trucks`