app/Controllers/UserController.php

    public function user()
    {
        $model = new UserModel();
        $data['users'] = $model->findAll();
---
SELECT *
FROM `users`